In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv("MER_T11_01A.csv")
df.head()

df.Description.unique()

df.Description = df.Description.apply(lambda x: x.replace('Crude Oil Production, ',''))

df.Description.unique()

array(['Algeria', 'Angola', 'Crude Oil Produciton, Congo - Brazzaville',
       'Ecuador', 'Gabon', 'Iran', 'Iraq', 'Kuwait', 'Libya', 'Nigeria',
       'Saudi Arabia', 'United Arab Emirates', 'Venezuela', 'Total OPEC'],
      dtype=object)

In [2]:
df.Description = df.Description.apply(lambda x: x.replace('Crude Oil Produciton, ',''))

df.head()

       MSN  YYYYMM   Value  Column_Order Description                      Unit
0  PAPRPAG  197301  1142.0             1     Algeria  Thousand Barrels per Day
1  PAPRPAG  197302  1142.0             1     Algeria  Thousand Barrels per Day
2  PAPRPAG  197303  1142.0             1     Algeria  Thousand Barrels per Day
3  PAPRPAG  197304  1142.0             1     Algeria  Thousand Barrels per Day
4  PAPRPAG  197305  1153.0             1     Algeria  Thousand Barrels per Day

In [3]:
df.Description.unique()

array(['Algeria', 'Angola', 'Congo - Brazzaville', 'Ecuador', 'Gabon',
       'Iran', 'Iraq', 'Kuwait', 'Libya', 'Nigeria', 'Saudi Arabia',
       'United Arab Emirates', 'Venezuela', 'Total OPEC'], dtype=object)

In [4]:
data = df

data = data.drop(columns=['MSN','Column_Order','Unit'])
data.head()

   YYYYMM   Value Description
0  197301  1142.0     Algeria
1  197302  1142.0     Algeria
2  197303  1142.0     Algeria
3  197304  1142.0     Algeria
4  197305  1153.0     Algeria

In [5]:
data.columns = ['year','Production', 'Country']
data.dtypes

year            int64
Production    float64
Country        object
dtype: object

In [6]:
data.head()

     year  Production  Country
0  197301      1142.0  Algeria
1  197302      1142.0  Algeria
2  197303      1142.0  Algeria
3  197304      1142.0  Algeria
4  197305      1153.0  Algeria

In [7]:
data.year= data.year.apply(lambda x: str(x))

data = data[data['year'].str.endswith('13')]
data.head()

data.year= data.year.apply(lambda x: int(x[:-2]))
data.dtypes

year            int64
Production    float64
Country        object
dtype: object

In [8]:
data.head()

    year  Production  Country
12  1973      1097.0  Algeria
25  1974      1008.6  Algeria
38  1975       982.6  Algeria
51  1976      1075.1  Algeria
64  1977      1152.3  Algeria

In [9]:
#data = data[data.year>=1986]

#data.Price = data.Price.astype('float', errors='ignore')

data1 = data[(data.Country == 'Total OPEC')]
data1.head()

      year  Production     Country
7799  1973   29275.781  Total OPEC
7812  1974   29066.700  Total OPEC
7825  1975   25612.258  Total OPEC
7838  1976   28883.127  Total OPEC
7851  1977   29394.800  Total OPEC

In [10]:
drop_indices = np.array(np.where(data.Country == 'Total OPEC')[0])
data = data.reset_index()
data = data.drop(drop_indices, axis=0)

In [11]:
data = data.drop(columns=['index'])

data['is_OPEC'] = np.array(True)

data.Country.unique()

array(['Algeria', 'Angola', 'Congo - Brazzaville', 'Ecuador', 'Gabon',
       'Iran', 'Iraq', 'Kuwait', 'Libya', 'Nigeria', 'Saudi Arabia',
       'United Arab Emirates', 'Venezuela'], dtype=object)

In [12]:
data.head()

   year  Production  Country  is_OPEC
0  1973      1097.0  Algeria     True
1  1974      1008.6  Algeria     True
2  1975       982.6  Algeria     True
3  1976      1075.1  Algeria     True
4  1977      1152.3  Algeria     True

In [13]:
data.dtypes

year            int64
Production    float64
Country        object
is_OPEC          bool
dtype: object

In [14]:
data.Production = data.Production/1000

In [15]:
data.head()

   year  Production  Country  is_OPEC
0  1973      1.0970  Algeria     True
1  1974      1.0086  Algeria     True
2  1975      0.9826  Algeria     True
3  1976      1.0751  Algeria     True
4  1977      1.1523  Algeria     True

In [16]:
data1.Production = data1.Production/1000

In [17]:
data.to_csv('production_OPEC.csv', index=False)

data1.to_csv('Total_OPEC_production.csv', index=False)

In [18]:
df2 = pd.read_csv("MER_T11_01B.csv")
df2.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,PAPRPPG,197301,20051,1,"Crude Oil Production, Persian Gulf Nations",Thousand Barrels per Day
1,PAPRPPG,197302,20335,1,"Crude Oil Production, Persian Gulf Nations",Thousand Barrels per Day
2,PAPRPPG,197303,20332,1,"Crude Oil Production, Persian Gulf Nations",Thousand Barrels per Day
3,PAPRPPG,197304,20241,1,"Crude Oil Production, Persian Gulf Nations",Thousand Barrels per Day
4,PAPRPPG,197305,21369,1,"Crude Oil Production, Persian Gulf Nations",Thousand Barrels per Day

In [19]:
df2.Description.unique()

array(['Crude Oil Production, Persian Gulf Nations',
       'Crude Oil Production, Canada', 'Crude Oil Production, China',
       'Crude Oil Production, Egypt', 'Crude Oil Production, Mexico',
       'Crude Oil Production, Norway',
       'Crude Oil Production, Former U.S.S.R',
       'Crude Oil Production, Russia',
       'Crude Oil Production, United Kingdom',
       'Crude Oil Production, United States',
       'Crude Oil Production, Total Non-OPEC',
       'Crude Oil Production, World'], dtype=object)

In [20]:
df2.Description = df2.Description.apply(lambda x: x.replace('Crude Oil Production, ',''))

In [21]:
df2.Description.unique()

array(['Persian Gulf Nations', 'Canada', 'China', 'Egypt', 'Mexico',
       'Norway', 'Former U.S.S.R', 'Russia', 'United Kingdom',
       'United States', 'Total Non-OPEC', 'World'], dtype=object)

In [22]:
df2.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,PAPRPPG,197301,20051,1,Persian Gulf Nations,Thousand Barrels per Day
1,PAPRPPG,197302,20335,1,Persian Gulf Nations,Thousand Barrels per Day
2,PAPRPPG,197303,20332,1,Persian Gulf Nations,Thousand Barrels per Day
3,PAPRPPG,197304,20241,1,Persian Gulf Nations,Thousand Barrels per Day
4,PAPRPPG,197305,21369,1,Persian Gulf Nations,Thousand Barrels per Day

In [23]:
data2 = df2

In [24]:
data2 = data2.drop(columns=['MSN','Column_Order','Unit'])
data2.head()

   YYYYMM  Value           Description
0  197301  20051  Persian Gulf Nations
1  197302  20335  Persian Gulf Nations
2  197303  20332  Persian Gulf Nations
3  197304  20241  Persian Gulf Nations
4  197305  21369  Persian Gulf Nations

In [26]:
df2.dtypes

MSN             object
YYYYMM           int64
Value           object
Column_Order     int64
Description     object
Unit            object
dtype: object

In [25]:
data2.columns = ['year','Production', 'Country']
data2.dtypes

year           int64
Production    object
Country       object
dtype: object

In [34]:
data2.Production[data2.Production =='Not Applicable']= None

/Users/marwaoussaifi/anaconda3/envs/ml/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [35]:
data2.Production = data2.Production.astype('float')

In [36]:
data2.dtypes

year            int64
Production    float64
Country        object
dtype: object

In [37]:
data2.year= data2.year.apply(lambda x: str(x))

In [38]:
data2 = data2[data2['year'].str.endswith('13')]
data2.head()

      year  Production               Country
12  197313     20668.0  Persian Gulf Nations
25  197413     21282.0  Persian Gulf Nations
38  197513     18934.0  Persian Gulf Nations
51  197613     21514.0  Persian Gulf Nations
64  197713     21725.0  Persian Gulf Nations

In [39]:
data2.year= data2.year.apply(lambda x: int(x[:-2]))

data2.head()

    year  Production               Country
12  1973     20668.0  Persian Gulf Nations
25  1974     21282.0  Persian Gulf Nations
38  1975     18934.0  Persian Gulf Nations
51  1976     21514.0  Persian Gulf Nations
64  1977     21725.0  Persian Gulf Nations

In [40]:
data2.dtypes

#data2 = data2[data2.year>=1986]

#data2.Price = data2.Price.astype('float', errors='ignore')

year            int64
Production    float64
Country        object
dtype: object

In [41]:
data21 = data2[(data2.Country == 'Total Non-OPEC') | (data2.Country == 'World')]
data21.head()

      year  Production         Country
6002  1973   26403.119  Total Non-OPEC
6015  1974   26649.790  Total Non-OPEC
6028  1975   27216.152  Total Non-OPEC
6041  1976   28461.273  Total Non-OPEC
6054  1977   30312.120  Total Non-OPEC

In [42]:
drop_indices = np.array(np.where((data2.Country == 'Total Non-OPEC') | (data2.Country == 'World') |(data2.Country == 'Persian Gulf Nations'))[0])
data2 = data2.reset_index()
data2 = data2.drop(drop_indices, axis=0)

In [43]:
data2.head()

    index  year  Production Country
46    611  1973      1798.0  Canada
47    624  1974      1551.0  Canada
48    637  1975      1430.0  Canada
49    650  1976      1314.0  Canada
50    663  1977      1321.0  Canada

In [44]:
data2 = data2.drop(columns=['index'])

data2['is_OPEC'] = np.array(False)

data2.Country.unique()

array(['Canada', 'China', 'Egypt', 'Mexico', 'Norway', 'Former U.S.S.R',
       'Russia', 'United Kingdom', 'United States'], dtype=object)

In [45]:
drop_indices = np.array(np.where((data2.Country == 'Former U.S.S.R'))[0])
data2 = data2.drop(drop_indices, axis=0)

In [46]:
data2.head()

    year  Production Country  is_OPEC
46  1973      1798.0  Canada    False
47  1974      1551.0  Canada    False
48  1975      1430.0  Canada    False
49  1976      1314.0  Canada    False
50  1977      1321.0  Canada    False

In [47]:
data2.dtypes

year            int64
Production    float64
Country        object
is_OPEC          bool
dtype: object

In [48]:
data2.Production = data2.Production/1000

In [49]:
data2.to_csv('production_Non_OPEC.csv', index=False)

In [50]:
data21.dtypes

year            int64
Production    float64
Country        object
dtype: object

In [51]:
data21.Production  = data21.Production/1000

In [52]:
data21.to_csv('Total_Non_OPEC_production.csv', index=False)

In [53]:
all_data = pd.concat([data,data2])

In [54]:
all_data.head()

   year  Production  Country  is_OPEC
0  1973      1.0970  Algeria     True
1  1974      1.0086  Algeria     True
2  1975      0.9826  Algeria     True
3  1976      1.0751  Algeria     True
4  1977      1.1523  Algeria     True

In [55]:
all_data.dtypes

year            int64
Production    float64
Country        object
is_OPEC          bool
dtype: object

In [56]:
all_data.Production.min()

0.002

In [57]:
all_data.Production.max()

12.053

In [58]:
all_data.to_csv("OPEC_Non_OPEC_production.csv", index=False)